cases/AR1_180/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

nutAround   1.332e-7;

internalField   uniform $nutAround;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    fixedWalls
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    up
    {
        type            symmetryPlane;    
    }
    middle
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            cyclic;   
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
