cases/AR1_180/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      42.287;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    fixedWalls
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    up
    {
        type            symmetryPlane;    
    }
    middle
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            cyclic;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
