cases/AR1_180/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            0;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;    
    }
    middle
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            cyclic;  
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
