cases/AR1_180/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1024;
        startFace       59136;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  outlet;
        separationVector (2 0 0);
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1280;
        startFace       60160;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          640;
        startFace       61440;
    }
    middle
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          640;
        startFace       62080;
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1024;
        startFace       62720;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  inlet;
        separationVector (-2 0 0);
    }
)

// ************************************************************************* //
