cases/AR1_180/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 1 0)
    (0 1 0)
    (0 0 1)
    (2 0 1)
    (2 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 32 32) simpleGrading (1 8 8)
);

edges
(
);

boundary
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        faces
        (
           (0 4 7 3)
        );
        transform       translational;
        neighbourPatch  outlet;
        separationVector (2 0 0);
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (1 5 4 0)
        );
    }
    up
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    middle
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        faces
        (
            (2 6 5 1)
        );
        transform       translational;
        neighbourPatch  inlet;
        separationVector (-2 0 0);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
