cases/AR1_180/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// this file has been created by prof. hence the order.

libs   ("libkOmegaSSTductFix.so");
application   simpleFoam;
startFrom   startTime;
startTime   0;
stopAt   endTime;
endTime   3000;
deltaT   1;
writeControl   timeStep;
writeInterval   3000;
purgeWrite   0;
writeFormat   ascii;
writePrecision   6;
writeCompression   off;
timeFormat   general;
timePrecision   6;
runTimeModifiable   true;

// ************************************************************************* //
